Login2/app/Controllers/Login.php

    public function validar()
    {
        helper(['form', 'url']);  // Helpers para manejar formularios y redirecciones

        // Obtiene los datos enviados vía POST desde el formulario
        $usuario = $this->request->getPost('username');
        $clave = $this->request->getPost('password');

        // Instancia el modelo y busca en la base de datos un usuario con esos datos
        $model = new UsuarioModel();
        $user = $model->where('user', $usuario)
                      ->where('password', $clave)
                      ->first();
---
SELECT *
FROM `usuarios`
WHERE `user` = 'dw'
AND `password` = '2134324'
 LIMIT 1